In [2]:
import numpy as np
import pandas as pd

In [18]:
s1 = pd.Series([1,2,3,4,5,6,7], index = list('abcdefg'), name = 'series1')
s2 = pd.Series([8,9,10,11,12,13,14], index = list('hijklmn'), name = 'series2')

df = pd.concat([s1,s2], axis = 1)
df

   series1  series2
a      1.0      NaN
b      2.0      NaN
c      3.0      NaN
d      4.0      NaN
e      5.0      NaN
f      6.0      NaN
g      7.0      NaN
h      NaN      8.0
i      NaN      9.0
j      NaN     10.0
k      NaN     11.0
l      NaN     12.0
m      NaN     13.0
n      NaN     14.0

In [4]:
df.dropna()

Empty DataFrame
Columns: [series1, series2]
Index: []

In [5]:
df.dropna(subset=['series1'])

   series1  series2
a      1.0      NaN
b      2.0      NaN
c      3.0      NaN
d      4.0      NaN
e      5.0      NaN
f      6.0      NaN
g      7.0      NaN

In [6]:
df.fillna(0)

   series1  series2
a      1.0      0.0
b      2.0      0.0
c      3.0      0.0
d      4.0      0.0
e      5.0      0.0
f      6.0      0.0
g      7.0      0.0
h      0.0      8.0
i      0.0      9.0
j      0.0     10.0
k      0.0     11.0
l      0.0     12.0
m      0.0     13.0
n      0.0     14.0

In [19]:
df3 = pd.DataFrame({'A': list('abbb'), 'B':list('bacd')})
df3

   A  B
0  a  b
1  b  a
2  b  c
3  b  d

In [8]:
df3['A'].value_counts()

b    3
a    1
Name: A, dtype: int64

In [9]:
df3.value_counts()

A  B
a  b    1
b  a    1
   c    1
   d    1
dtype: int64

In [22]:
df.sort_values(by = ['series2'])

   series1  series2
h      NaN      8.0
i      NaN      9.0
j      NaN     10.0
k      NaN     11.0
l      NaN     12.0
m      NaN     13.0
n      NaN     14.0
a      1.0      NaN
b      2.0      NaN
c      3.0      NaN
d      4.0      NaN
e      5.0      NaN
f      6.0      NaN
g      7.0      NaN

In [23]:
df.idxmin() #returns index of minimum values per column

series1    a
series2    h
dtype: object

In [ ]:
#df.to_pickle('filename')
#read_pickle('')

In [ ]:
#ask for sir's notebook for the df.str parts

In [ ]:
str.split()
str.contains('word')
str.replace('oldword', 'newword')

In [24]:
df.replace?